# Set application directory
cask_args appdir: '/Applications'

# Install CLI tool to install applications
tap 'caskroom/cask'

# Install packages necessary for development
brew 'git'
brew 'tmux'
brew 'node'
brew 'npm'
brew 'postgresql'
brew 'mysql'
brew 'python3'
brew 'pipenv'
brew 'wget'
brew 'ruby'
brew 'neovim'
brew 'ack'

# Install applications for development
cask 'iterm2'
cask 'flux'
cask 'firefox'
cask 'google-chrome'
cask 'vlc'
cask 'visual-studio-code'
cask 'virtualbox'
cask 'docker'
cask 'slack'
